# 4. * (вместо задачи 3) Написать функцию thesaurus_adv(), принимающую в качестве аргументов строки
# в формате «Имя Фамилия» и возвращающую словарь, в котором ключи — первые буквы фамилий, а значения — словари,
# реализованные по схеме предыдущего задания и содержащие записи, в которых фамилия начинается с соответствующей буквы.
# Например:
# >>> thesaurus_adv("Иван Сергеев", "Инна Серова", "Петр Алексеев", "Илья Иванов", "Анна Савельева")
# {
#     "А": {
#         "П": ["Петр Алексеев"]
#     },
#     "И": {
#         "И": ["Илья Иванов"]
#     },
#     "С": {
#         "И": ["Иван Сергеев", "Инна Серова"],
#         "А": ["Анна Савельева"]
#     }
# }
# Как поступить, если потребуется сортировка по ключам?

def thesaurus_adv(*names_surnames):                 # Создали функцию, которая принимает в качестве аргументов строки в формате «Имя Фамилия»
    out_dict = {}                                   # Которая возвращает словарь
    for name_surname in names_surnames:
        name, surname = name_surname.split()
        out_dict.setdefault(surname[0],{})          # в котором ключи - первые буквы фамилий
        out_dict[surname[0]].setdefault(name[0],[])
        out_dict[surname[0]][name[0]].append(name_surname)


    return out_dict


print(thesaurus_adv("Иван Сергеев", "Инна Серова", "Петр Алексеев", "Илья Иванов", "Анна Савельева"))

# Выводится чехарда какая-то, почему - не разобралась